<p>quick-cocos2d-x &#26159; cocos2d-x &#24320;&#21457;&#21830;&#8220;<a href="http://www.chukong-inc.com/">&#35302;&#25511;&#31185;&#25216;</a>&#8221;&#19987;&#38376;&#38024;&#23545; Lua &#24320;&#21457;&#32773;&#25512;&#20986;&#30340;&#25193;&#23637;&#29256;&#26412;&#12290;</p>
<p>&#22312;&#21407;&#29256; cocos2d-x &#22522;&#30784;&#19978;&#25552;&#20379;&#20102;&#26356;&#20016;&#23500;&#30340;&#21151;&#33021;&#21644;&#26356;&#24378;&#22823;&#30340;&#25193;&#23637;&#33021;&#21147;&#65292;&#20197;&#21450;&#19968;&#31995;&#21015;&#33258;&#21160;&#21270;&#24037;&#20855;&#65292;&#35753;&#24320;&#21457;&#32773;&#21487;&#20197;&#20351;&#29992; Lua &#36825;&#31181;&#31616;&#21333;&#26131;&#29992;&#30340;&#33050;&#26412;&#35821;&#35328;&#23436;&#25104;&#21830;&#19994;&#21697;&#36136;&#30340;&#31227;&#21160;&#28216;&#25103;&#12290;</p>
<ul>
<li>quick-cocos2d-x &#20013;&#25991;&#31449; <a href="http://quick.cocoachina.com/">http://quick.cocoachina.com/</a></li>
<li>&#26032;&#28010;&#24494;&#21338; <a href="http://weibo.com/quickcocos2dx">http://weibo.com/quickcocos2dx</a></li>
<li>QQ &#32676; 284148017, 243709595</li>
<li>CSDN &#38236;&#20687;&#20179;&#24211;&#65288;&#22269;&#20869;&#35775;&#38382;&#31283;&#23450;&#24555;&#36895;&#65289;&#65292;100% &#21644; github &#20179;&#24211;&#21516;&#27493;&#65292;&#22320;&#22336; <a href="https://code.csdn.net/u014257247/quick-cocos2d-x">https://code.csdn.net/u014257247/quick-cocos2d-x</a></li>
<li><strong>&#22914;&#26524;&#20320;&#35273;&#24471; quick-cocos2d-x &#38752;&#35889;&#65292;&#35831;&#28857;&#19968;&#19979;&#26412;&#39029;&#38754;&#19978;&#30340; &quot;Star&quot; &#25353;&#38062;</strong></li>
</ul>
<p>~</p>
<h2 id="&#20026;&#20160;&#20040;&#36873;&#25321;-quick-cocos2d-x">&#20026;&#20160;&#20040;&#36873;&#25321; quick-cocos2d-x</h2>
<p>&#22312;&#36825;&#20010;&#8220;&#20197;&#24555;&#33268;&#32988;&#8221;&#30340;&#26102;&#20195;&#65292;&#29983;&#20135;&#21147;&#24456;&#22823;&#31243;&#24230;&#19978;&#20915;&#23450;&#20102;&#25104;&#36133;&#65281;</p>
<ul>
<li><p><strong>Lua &#26159;&#25104;&#29087;&#12289;&#26080;&#39118;&#38505;&#30340;&#36873;&#25321;</strong>: cocos2d-x &#23545; Lua &#30340;&#25903;&#25345;&#24050;&#32463;&#24456;&#25104;&#29087;&#65292;&#22269;&#20869;&#22806;&#22810;&#23478;&#22823;&#22411;&#24320;&#21457;&#21830;&#37117;&#22312;&#20351;&#29992; cocos2d-x + Lua &#24320;&#21457;&#28216;&#25103;&#12290;&#32780;&#19988; Lua &#22312;&#28216;&#25103;&#39046;&#22495;&#24050;&#32463;&#26377;&#21313;&#22810;&#24180;&#30340;&#23454;&#36341;&#20351;&#29992;&#65292;&#34987;&#21508;&#31181;&#22823;&#22411;&#31471;&#28216;&#25152;&#24212;&#29992;&#12290;&#25152;&#20197;&#21487;&#20197;&#25214;&#21040;&#21508;&#31181; Lua &#30340;&#24320;&#28304;&#39033;&#30446;&#26469;&#36827;&#19968;&#27493;&#38477;&#20302;&#24320;&#21457;&#25104;&#26412;&#12290;</p></li>
<li><p><strong>&#20302;&#38376;&#27099;&#12289;&#39640;&#25928;&#29575;</strong>: Lua &#31616;&#21333;&#26131;&#29992;&#65292;&#20102;&#35299;&#20219;&#20309;&#19968;&#31181;&#35821;&#35328;&#30340;&#24320;&#21457;&#32773;&#37117;&#21487;&#20197;&#22312;&#19968;&#21608;&#20869;&#25484;&#25569;&#12290;&#32780;&#19988; quick-cocos2d-x &#25552;&#20379;&#20102;&#19968;&#20010;&#20840;&#21151;&#33021;&#30340;&#65292;&#22522;&#20110; Lua &#35821;&#35328;&#30340;&#39640;&#23618;&#24320;&#21457;&#26694;&#26550;&#12290;&#36825;&#20010;&#26694;&#26550;&#21487;&#20197;&#26497;&#22823;&#31243;&#24230;&#38477;&#20302;&#28216;&#25103;&#24320;&#21457;&#30340;&#38376;&#27099;&#24182;&#25552;&#39640;&#24320;&#21457;&#25928;&#29575;&#12290;&#19968;&#20010;&#27809;&#26377;&#20219;&#20309; C++ &#30693;&#35782;&#30340;&#22242;&#38431;&#20063;&#33021;&#21019;&#24314;&#21830;&#19994;&#21697;&#36136;&#30340;&#31227;&#21160;&#28216;&#25103;&#12290;</p></li>
<li><p><strong>&#20986;&#33394;&#30340;&#26694;&#26550;&#35774;&#35745;</strong>: quick-cocos2d-x &#30001;&#20855;&#22791;&#22810;&#24180;&#26694;&#26550;&#21644; API &#35774;&#35745;&#32463;&#39564;&#30340;&#36164;&#28145;&#24320;&#21457;&#32773;&#21019;&#24314;&#12290;&#20043;&#21069;&#25105;&#20204;&#21019;&#24314;&#30340; FleaPHP&#12289;QeePHP &#37117;&#26159;&#22269;&#20869;&#39030;&#23574;&#30340; PHP &#24320;&#21457;&#26694;&#26550;&#20043;&#19968;&#12290;&#20170;&#26102;&#20170;&#26085;&#65292;&#25105;&#20204;&#23558;&#22810;&#24180;&#26469;&#31215;&#32047;&#30340;&#32463;&#39564;&#24102;&#21040;&#20102;&#31227;&#21160;&#39046;&#22495;&#65292;&#20026;&#31227;&#21160;&#28216;&#25103;&#24320;&#21457;&#25552;&#20379;&#20102;&#19968;&#27969;&#36136;&#37327;&#30340;&#24320;&#21457;&#26694;&#26550;&#25903;&#25345;&#12290;</p></li>
<li><p><strong>&#26080;&#30171;&#21319;&#32423;</strong>: &#39640;&#23618;&#24320;&#21457;&#26694;&#26550;&#30340;&#24341;&#20837;&#65292;&#32479;&#19968;&#20102;&#24213;&#23618; cocos2d-x &#30340; API&#65292;&#35299;&#20915;&#20102; cocos2d-x &#21319;&#32423;&#25913;&#36827;&#26102;&#23545;&#28216;&#25103;&#24320;&#21457;&#21644;&#32500;&#25252;&#24102;&#26469;&#30340;&#24433;&#21709;&#12290;&#22242;&#38431;&#19981;&#20877;&#38656;&#35201;&#32416;&#32467;&#26159;&#21542;&#21319;&#32423;&#65292;&#27809;&#26377;&#20219;&#20309;&#30171;&#33510;&#23601;&#21487;&#20197;&#33719;&#24471;&#26368;&#26032;&#29256; cocos2d-x &#24102;&#26469;&#30340;&#22909;&#22788;&#12290;quick-cocos2d-x &#23558;&#20250;&#32039;&#36319; cocos2d-x &#30340;&#29256;&#26412;&#21457;&#24067;&#65292;&#24182;&#19988;&#23613;&#21147;&#20445;&#35777;&#39640;&#23618;&#26694;&#26550;&#30340; API &#19981;&#21457;&#29983;&#30772;&#22351;&#20860;&#23481;&#24615;&#30340;&#21464;&#21270;&#12290;</p></li>
<li><p><strong>&#26080;&#38480;&#30340;&#25193;&#23637;&#33021;&#21147;</strong>: quick-cocos2d-x &#20934;&#22791;&#20102;&#22810;&#31181;&#25193;&#23637;&#65292;&#35753;&#24320;&#21457;&#32773;&#21487;&#20197;&#29992; C++/Java/Objective-C &#35821;&#35328;&#24320;&#21457;&#19982;&#35774;&#22791;&#25805;&#20316;&#31995;&#32479;&#12289;&#31532;&#19977;&#26041;&#24179;&#21488;&#30456;&#20851;&#30340;&#21151;&#33021;&#65292;&#24182;&#26041;&#20415;&#30340;&#38598;&#25104;&#21040; Lua &#33050;&#26412;&#20013;&#12290;&#32780;&#19988; quick-cocos2d-x &#36824;&#38468;&#24102;&#20102;&#39044;&#20808;&#24320;&#21457;&#23436;&#25104;&#30340;&#31532;&#19977;&#26041;&#24211;&#65292;&#21487;&#20197;&#20026;&#28216;&#25103;&#28155;&#21152;&#25903;&#20184;&#12289;&#20998;&#26512;&#12289;&#24191;&#21578;&#31561;&#26381;&#21153;&#12290;&#38543;&#30528;&#26102;&#38388;&#30340;&#27969;&#36893;&#65292;&#36825;&#20123;&#25193;&#23637;&#25554;&#20214;&#36824;&#22312;&#19981;&#26029;&#22686;&#21152;&#65292;&#24182;&#19988;&#20840;&#37096;&#20197;&#24320;&#28304;&#24418;&#24335;&#21457;&#24067;&#12290;</p></li>
<li><p><strong>&#22686;&#24378;&#30340;&#24320;&#21457;&#29615;&#22659;</strong>: &#22312; Windows &#21644; Mac &#29615;&#22659;&#19979;&#65292;quick-cocos2d-x &#25552;&#20379;&#20102;&#26356;&#23436;&#21892;&#30340;&#27169;&#25311;&#22120;&#65292;&#24320;&#21457;&#32773;&#21482;&#35201;&#19968;&#20010;&#25191;&#34892;&#25991;&#20214;&#23601;&#21487;&#20197;&#24320;&#22987;&#28216;&#25103;&#30340;&#24320;&#21457;&#21644;&#27979;&#35797;&#12290;</p></li>
<li><p><strong>&#26368;&#24555;&#30340;&#33050;&#26412;&#24341;&#25806;</strong>: Lua &#26159;&#8220;&#26368;&#24555;&#8221;&#30340;&#33050;&#26412;&#35821;&#35328;&#20043;&#19968;&#65292;&#32780; quick-cocos2d-x &#38598;&#25104;&#20102; LuaJIT&#65292;&#22312;&#25903;&#25345; JIT &#30340;&#35774;&#22791;&#19978;&#65292;&#21487;&#20197;&#23558; Lua &#33050;&#26412;&#32534;&#35793;&#20026;&#26426;&#22120;&#30721;&#25191;&#34892;&#65292;&#24615;&#33021;&#26080;&#20197;&#20262;&#27604;&#12290;</p></li>
<li><p><strong>&#24320;&#25918;&#28304;&#20195;&#30721;</strong>: cocos2d-x&#12289;Lua&#65292;&#20197;&#21450; quick-cocos2d-x &#37117;&#26159;&#24320;&#28304;&#30340;&#39033;&#30446;&#12290;&#36825;&#24847;&#21619;&#30528;&#26356;&#20302;&#30340;&#25104;&#26412;&#12289;&#33258;&#30001;&#20462;&#25913;&#30340;&#26435;&#21033;&#65292;&#20197;&#21450;&#24555;&#36895;&#21457;&#23637;&#30340;&#25216;&#26415;&#12290; &#160;</p></li>
</ul>
<p>~</p>
<h3 id="framework-main-features">Framework main features:</h3>
<ul>
<li>display: creates scenes, display objects, animation ...</li>
<li>transition: moving, fades, creates animation programing easy ...</li>
<li>audio: play background music, effect sounds ...</li>
<li>ui: creates button, menu, label ...</li>
<li>luaoc: Lua call Objective-C, Objective-C call Lua ...</li>
<li>luaj: Lua call Java, Java call Lua ...</li>
<li>network: Asynchronous HTTP requests, JSON, check the network status ...</li>
<li>physics: Chipmunk integration ...</li>
</ul>
